posts/2024/09/05/guard-methods-on-clos-generic-functions.org
# -*- org-attach-id-dir: "../../../../files/attachments"; -*-
#+BEGIN_COMMENT
.. title: Guard methods on CLOS generic functions
.. slug: guard-methods-on-clos-generic-functions
.. date: 2024-09-05 15:36:23 UTC+01:00
.. tags: lisp, programming
.. category:
.. link:
.. description:
.. type: text

#+END_COMMENT
* Guard methods on CLOS generic functions

  There are times when one wants to be able to guard a method's
  execution. A typical case is for callbacks, where we only want the
  callback to run under certain circumstances -- but it's easier to
  write the callbacks themselves as though they'll /always/ be called.

  Object-oriented programs typically use a pattern for this: they
  split the function into two methods, one for the guard and one for
  the action being guarded. A sub-class can then override the guard
  independently of the action, and some sub-classes may override
  both guard and action.

  This splitting seems a little awkward, though, and there are times
  when I'd prefer to have everything (guard and action) defined as
  part of the one method. Fortunately there's a Lisp-ier solution
  involving defining a new method combination to get exactly this
  behaviour.

** Standard method combination

     CLOS, unlike most languages, allows a programmer to control how
     methods are combined in terms of overriding. The "standard"
     combination allows for ~:before~, ~:after~, and ~:around~ methods as
     well as undecorated "primary" methods.

     When a generic function is called, the list of applicable primary
     methods is determined based on the types of arguments. most
     specific method first[fn:most-specific-first].

     The same process is performed for all applicable ~:before~ methods,
     and then again for applicable ~:after~ methods, and then /again/ for
     ~:around~ methods. The ~:after~ and ~:around~ are always ordered most
     specific first, while the ~:before~ methods are always ordered
     least-specific first.

     Once these lists have been constructed, the "effective" method
     that results is called. If there are ~:around~ methods, they are
     called in order. An ~:around~ method may, as part of its body, call
     ~call-next-method~ to invoke the next-most-specific ~:around~ method
     -- or may not.

     If a call to ~call-next-method~ has no more ~:around~ methods to call
     -- or of there were no ~:around~ methods defined -- all the ~:before~
     methods are run and their return values discarded. Then the
     primary methods are run in the same manner as ~:around~ methods,
     with any calls to ~call-next-method~ calling the next primary
     method. After the primary methods have returned, all the ~:after~
     methods are run and their return values discarded. The result of
     the method call is the result returned from the primary methods.
     The process is roughly like:

     #+begin_src lisp
(if arounds
    (call-method (car arounds) (cdr arounds)))

(prog1
    (progn
      (call-methods befores)
      (call-method (car primaries) (cdr primaries)))
  (call-methods afters))
     #+end_src

     In this code, ~call-method~ calls its first method argument, and
     any call to ~call-next-method~ calls the next method in the list.
     ~call-methods~ calls all the methods in a list of methods,
     discarding their return values.

     Contrast that with Java or Python, where methods on more-specific
     classes override those on less-specific, and have the option to
     call up to the superclass method. Essentially this makes all
     methods similar to ~:around~, and there's no real equivalent of
     ~:before~ and ~:after~.

** Other method combinations

   The above is referred to as /standard method combination/, implying
   the existence of /non-standard/ combination. CLOS lets the
   programmer define new combinations, and indeed defines a few
   itself. For our purposes the most important alternative method
   combination is ~and~, which runs all primary methods within an ~and~
   form treating all methods as predicates. There are only primary
   methods allowed.

** Guards as method combination

   For our use case, we want to be able to return values from primary
   methods, and allow ~:around~, ~:before~ and ~:after~ methods. However, we
   /also/ want to have some methods act as predicates that guard the
   execution of the effective method thus formed. We want to be able
   to add guard methods that are always run first, regardless of their
   specificity, and then run the effective method only if /all/ the guards
   are satisfied. The net result is that all parts of the generic
   function are provided as methods on it, but some can now be boolean
   guards that act as gatekeepers on the rest of the methods.
   Naturally we want the guards to be selected for specificity
   alongside the other methods, letting the CLOS machinery pick /all/
   the functionality that's appropriate to a particular method call.

