2024/09/05/guard-methods-on-clos-generic-functions/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Guard methods on CLOS generic functions | Simon Dobson</title>
<link rel="icon" href="../../../../images/favicon.png" sizes="16x16">
<link rel="alternate" type="application/rss+xml" href="../../../../rss.xml">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Droid+Sans+Mono|Libre+Baskerville|Montserrat|Playfair+Display|Tangerine">
<link rel="stylesheet" href="../../../../assets/css/libretto_styles.css">
<link rel="stylesheet" href="../../../../assets/css/baguetteBox.min.css">
<link rel="stylesheet" href="../../../../assets/css/code.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_rst.css">
<link rel="stylesheet" href="../../../../assets/css/nikola_ipython.css">
<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.0.13/css/all.css" integrity="sha384-DNOHZ68U8hZfKXOrtjWvjxusGo9WQnrNx2sqG0tfsghAvtVlRW3tvkXWZh58N9jp" crossorigin="anonymous">
</head>
<body>
    <!-- Navigation bar -->
    <header class="nav-bar"><div class="site-branding">
	    <h1 class="site-title">
		<a href="https://simondobson.org/" title="Simon Dobson" rel="home">Simon&nbsp;Dobson</a>
	    </h1>
	</div>
	<nav class="site-navigation" role="navigation"><div class="menu-toggle">
		<span class="mobile-site-title">Simon Dobson</span>
	    </div>
	    <ul class="menu">
<li><a href="../../../../index.html">Home</a></li>
		    <li><a href="../../../../personal/">About&nbsp;me</a></li>
		    <li><a href="../../../../research/">Research</a></li>
		    <li><a href="../../../../development/projects/">Software</a></li>
		    <li><a href="../../../../writing/">Writing</a></li>
		    <li><a href="../../../../personal/contact/">Contact</a></li>
		<li>
<a href="../../../../rss.xml"><i class="fa fa-rss"></i></a>
	    </li>
</ul></nav></header><!-- Page Header --><div class="title-block post-format-icon-pin">
	<div class="entry-meta">
	    <span class="posted-on">
		Posted on <a href="." rel="bookmark">Thursday 5 September, 2024</a>
	    </span>
	</div>
	<h1>Guard methods on <span class="caps">CLOS</span> generic&nbsp;functions</h1>
    </div>

	<!-- Page Content -->
    <div class="site-content" role="main">
	<article class="format-standard libretto-long-form"><div class="entry-content">
		<div id="outline-container-orgdad2bf2" class="outline-2">
<h2 id="orgdad2bf2">Guard methods on <span class="caps">CLOS</span> generic&nbsp;functions</h2>
<div class="outline-text-2" id="text-orgdad2bf2">
<p>
There are times when one wants to be able to guard a method&#8217;s
execution. A typical case is for callbacks, where we only want the
callback to run under certain circumstances – but it&#8217;s easier to
write the callbacks themselves as though they&#8217;ll <i>always</i> be&nbsp;called.
</p>

<p>
Object-oriented programs typically use a pattern for this: they
split the function into two methods, one for the guard and one for
the action being guarded. A sub-class can then override the guard
independently of the action, and some sub-classes may override
both guard and&nbsp;action.
</p>

<p>
This splitting seems a little awkward, though, and there are times
when I&#8217;d prefer to have everything (guard and action) defined as
part of the one method. Fortunately there&#8217;s a Lisp-ier solution
involving defining a new method combination to get exactly this&nbsp;behaviour.
</p>
</div>
<div id="outline-container-orgc6422b3" class="outline-3">
<h3 id="orgc6422b3">Standard method&nbsp;combination</h3>
<div class="outline-text-3" id="text-orgc6422b3">
<p>
<span class="caps">CLOS</span>, unlike most languages, allows a programmer to control how
methods are combined in terms of overriding. The &#8220;standard&#8221;
combination allows&nbsp;for <code>:before</code>, <code>:after</code>,&nbsp;and <code>:around</code> methods as
well as undecorated &#8220;primary&#8221;&nbsp;methods.
</p>

<p>
When a generic function is called, the list of applicable primary
methods is determined based on the types of arguments. most
specific method first<sup><a id="fnr.most-specific-first" class="footref" href="#fn.most-specific-first" role="doc-backlink">1</a></sup>.
</p>

<p>
The same process is performed for all&nbsp;applicable <code>:before</code> methods,
and then again for&nbsp;applicable <code>:after</code> methods, and then <i>again</i>&nbsp;for
<code>:around</code> methods.&nbsp;The <code>:after</code> and <code>:around</code> are always ordered most
specific first, while&nbsp;the <code>:before</code> methods are always ordered
least-specific&nbsp;first.
</p>

<p>
Once these lists have been constructed, the &#8220;effective&#8221; method
that results is called. If there&nbsp;are <code>:around</code> methods, they are
called in order.&nbsp;An <code>:around</code> method may, as part of its body,&nbsp;call
<code>call-next-method</code> to invoke the&nbsp;next-most-specific <code>:around</code> method
– or may&nbsp;not.
</p>

<p>
If a call&nbsp;to <code>call-next-method</code> has no&nbsp;more <code>:around</code> methods to call
– or of there were&nbsp;no <code>:around</code> methods defined – all&nbsp;the <code>:before</code>
methods are run and their return values discarded. Then the
primary methods are run in the same manner&nbsp;as <code>:around</code> methods,
with any calls&nbsp;to <code>call-next-method</code> calling the next primary
method. After the primary methods have returned, all&nbsp;the <code>:after</code>
methods are run and their return values discarded. The result of
the method call is the result returned from the primary methods.
The process is roughly&nbsp;like:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="nv">arounds</span>
<span class="w">         </span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="p">(</span><span class="nb">car</span><span class="w"> </span><span class="nv">arounds</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nb">cdr</span><span class="w"> </span><span class="nv">arounds</span><span class="p">)))</span>

<span class="w">     </span><span class="p">(</span><span class="nb">prog1</span>
<span class="w">         </span><span class="p">(</span><span class="k">progn</span>
<span class="w">           </span><span class="p">(</span><span class="nv">call-methods</span><span class="w"> </span><span class="nv">befores</span><span class="p">)</span>
<span class="w">           </span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="p">(</span><span class="nb">car</span><span class="w"> </span><span class="nv">primaries</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nb">cdr</span><span class="w"> </span><span class="nv">primaries</span><span class="p">)))</span>
<span class="w">       </span><span class="p">(</span><span class="nv">call-methods</span><span class="w"> </span><span class="nv">afters</span><span class="p">))</span>
</pre></div>

<p>
In this&nbsp;code, <code>call-method</code> calls its first method argument, and
any call&nbsp;to <code>call-next-method</code> calls the next method in the&nbsp;list.
<code>call-methods</code> calls all the methods in a list of methods,
discarding their return&nbsp;values.
</p>

<p>
Contrast that with Java or Python, where methods on more-specific
classes override those on less-specific, and have the option to
call up to the superclass method. Essentially this makes all
methods similar&nbsp;to <code>:around</code>, and there&#8217;s no real equivalent&nbsp;of
<code>:before</code> and <code>:after</code>.
</p>
</div>
</div>
<div id="outline-container-orga578c83" class="outline-3">
<h3 id="orga578c83">Other method&nbsp;combinations</h3>
<div class="outline-text-3" id="text-orga578c83">
<p>
The above is referred to as <i>standard method combination</i>, implying
the existence of <i>non-standard</i> combination. <span class="caps">CLOS</span> lets the
programmer define new combinations, and indeed defines a few
itself. For our purposes the most important alternative method
combination&nbsp;is <code>and</code>, which runs all primary methods within&nbsp;an <code>and</code>
form treating all methods as predicates. There are only primary
methods&nbsp;allowed.
</p>
</div>
</div>
<div id="outline-container-org85cc730" class="outline-3">
<h3 id="org85cc730">Guards as method&nbsp;combination</h3>
<div class="outline-text-3" id="text-org85cc730">
<p>
For our use case, we want to be able to return values from primary
methods, and&nbsp;allow <code>:around</code>, <code>:before</code> and <code>:after</code> methods. However, we
<i>also</i> want to have some methods act as predicates that guard the
execution of the effective method thus formed. We want to be able
to add guard methods that are always run first, regardless of their
specificity, and then run the effective method only if <i>all</i> the guards
are satisfied. The net result is that all parts of the generic
function are provided as methods on it, but some can now be boolean
guards that act as gatekeepers on the rest of the methods.
Naturally we want the guards to be selected for specificity
alongside the other methods, letting the <span class="caps">CLOS</span> machinery pick <i>all</i>
the functionality that&#8217;s appropriate to a particular method&nbsp;call.
</p>
</div>
</div>
