posts/2024/09/05/guard-methods-on-clos-generic-functions.org
** Why this isn't just ~:around~

     It might sound like we can get this behaviour using ~:around~
     methods that perform guarding. But we can't -- quite.

     Suppose we define a primary method:

     #+begin_src lisp :results none
(defmethod example ((v integer))
  (* v 2))
     #+end_src

     We can write a guard quite happily as an ~:around~ method:

     #+begin_src lisp :results none
(defmethod example :around ((v number))
  (when (> v 10)
    (call-next-method)))
     #+end_src

     This method will only allow the method to proceed when the
     condition holds, otherwise it returns ~nil~.

     #+begin_src lisp :results raw
(list (example 26) (example 2))
     #+end_src

#+RESULTS:
(52 NIL)

     So far so good.

     However, the problem is that CLOS orders the ~:around~ methods
     most specific first. Suppose we have another ~:around~ method
     specialised against a more specific type:

     #+begin_src lisp :results none
(defmethod example :around ((v integer))
  (if (= v 5)
      (+ v 1)
      (call-next-method)))
     #+end_src

     When this method is called with an integer this method gets run
     before the previous guard:

     #+begin_src lisp :results raw
(example 5)
     #+end_src

#+RESULTS:
6

     and we get a non-nil result, despite the guard method indicating
     that we shouldn't. If we provide an argument that doesn't trigger
     the first ~:around~ method, then we can get caught by the guard:

     #+begin_src lisp :results raw
(example 6)
     #+end_src

#+RESULTS:
NIL

     This is of course perfectly sensible behaviour in many cases.
     However, it does mean that the "guards" we're supplying are
     executed as /part/ of the effective method rather than /before/ it,
     and therefore can't guarantee that the method is properly guarded
     by /all/ the guards, regardless of their specialisation. Another
     way of looking at this is that a later, more specialised, "guard"
     can override one set by an earlier, less specialised, method,
     which again may not be what's desired.

