2024/09/05/guard-methods-on-clos-generic-functions/index.html
<div id="outline-container-org2b8a7b0" class="outline-3">
<h3 id="org2b8a7b0">Why this isn&#8217;t&nbsp;just <code>:around</code>
</h3>
<div class="outline-text-3" id="text-org2b8a7b0">
<p>
It might sound like we can get this behaviour&nbsp;using <code>:around</code>
methods that perform guarding. But we can&#8217;t –&nbsp;quite.
</p>

<p>
Suppose we define a primary&nbsp;method:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">example</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">integer</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="nb">*</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">2</span><span class="p">))</span>
</pre></div>

<p>
We can write a guard quite happily as&nbsp;an <code>:around</code> method:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">example</span><span class="w"> </span><span class="ss">:around</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">number</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="nb">when</span><span class="w"> </span><span class="p">(</span><span class="nb">&gt;</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">10</span><span class="p">)</span>
<span class="w">         </span><span class="p">(</span><span class="nb">call-next-method</span><span class="p">)))</span>
</pre></div>

<p>
This method will only allow the method to proceed when the
condition holds, otherwise it&nbsp;returns <code>nil</code>.
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="p">(</span><span class="nv">example</span><span class="w"> </span><span class="mi">26</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nv">example</span><span class="w"> </span><span class="mi">2</span><span class="p">))</span>
</pre></div>
<p>
(52&nbsp;<span class="caps">NIL</span>)
</p>

<p>
So far so&nbsp;good.
</p>

<p>
However, the problem is that <span class="caps">CLOS</span> orders&nbsp;the <code>:around</code> methods
most specific first. Suppose we have&nbsp;another <code>:around</code> method
specialised against a more specific&nbsp;type:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">example</span><span class="w"> </span><span class="ss">:around</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">integer</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nb">=</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">5</span><span class="p">)</span>
<span class="w">           </span><span class="p">(</span><span class="nb">+</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">1</span><span class="p">)</span>
<span class="w">           </span><span class="p">(</span><span class="nb">call-next-method</span><span class="p">)))</span>
</pre></div>

<p>
When this method is called with an integer this method gets run
before the previous&nbsp;guard:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nv">example</span><span class="w"> </span><span class="mi">5</span><span class="p">)</span>
</pre></div>
<p>
6
</p>

<p>
and we get a non-nil result, despite the guard method indicating
that we shouldn&#8217;t. If we provide an argument that doesn&#8217;t trigger
the&nbsp;first <code>:around</code> method, then we can get caught by the&nbsp;guard:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nv">example</span><span class="w"> </span><span class="mi">6</span><span class="p">)</span>
</pre></div>
<p>
<span class="caps">NIL</span>
</p>

<p>
This is of course perfectly sensible behaviour in many cases.
However, it does mean that the &#8220;guards&#8221; we&#8217;re supplying are
executed as <i>part</i> of the effective method rather than <i>before</i> it,
and therefore can&#8217;t guarantee that the method is properly guarded
by <i>all</i> the guards, regardless of their specialisation. Another
way of looking at this is that a later, more specialised, &#8220;guard&#8221;
can override one set by an earlier, less specialised, method,
which again may not be what&#8217;s&nbsp;desired.
</p>
</div>
</div>
