2024/09/05/guard-methods-on-clos-generic-functions/index.html
<div id="outline-container-org88504e4" class="outline-3">
<h3 id="org88504e4">A <code>guarded</code> method&nbsp;combination</h3>
<div class="outline-text-3" id="text-org88504e4">
<p>
Fortunately we can get the behaviour we want by defining a new
method&nbsp;combination, <code>guarded</code>.&nbsp;A <code>guarded</code> generic function accepts
five method&nbsp;qualifiers:
</p>

<ul class="org-ul">
<li>undecorated primary&nbsp;methods;</li>
<li>
<code>:before</code> and <code>:after</code> methods that run before and after the
primary&nbsp;methods;</li>
<li>
<code>:around</code> methods that run around&nbsp;the <code>:before</code>-primary-<code>:after</code>
combination;&nbsp;and</li>
<li>
<code>:if</code> methods that act as guards, running before&nbsp;any <code>:around</code>
methods to determine whether <i>any</i> of the &#8220;functional&#8221; methods
are run or&nbsp;not</li>
</ul>
<p>
We first need a helper function<sup><a id="fnr.call-methods" class="footref" href="#fn.call-methods" role="doc-backlink">2</a></sup> to construct the
code to run the chain&nbsp;of <code>:before</code> and <code>:after</code> methods while
discarding their return&nbsp;values.
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">defun</span><span class="w"> </span><span class="nv">call-methods</span><span class="w"> </span><span class="p">(</span><span class="nv">methods</span><span class="p">)</span>
<span class="w">       </span><span class="s">"Return `call-method' forms for all METHODS."</span>
<span class="w">       </span><span class="p">(</span><span class="nb">mapcar</span><span class="w"> </span><span class="nf">#'</span><span class="p">(</span><span class="k">lambda</span><span class="w"> </span><span class="p">(</span><span class="nv">m</span><span class="p">)</span>
<span class="w">                   </span><span class="o">`</span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="o">,</span><span class="nv">m</span><span class="p">))</span>
<span class="w">               </span><span class="nv">methods</span><span class="p">))</span>
</pre></div>

<p>
We can then use the&nbsp;macro <code>define-method-combination</code> to define our
new method&nbsp;combination.
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="p">(</span><span class="nb">define-method-combination</span><span class="w"> </span><span class="nv">guarded</span><span class="w"> </span><span class="p">(</span><span class="k">&amp;optional</span><span class="w"> </span><span class="p">(</span><span class="nv">order</span><span class="w"> </span><span class="ss">:most-specific-first</span><span class="p">))</span>
<span class="w">       </span><span class="p">((</span><span class="nv">arounds</span><span class="w"> </span><span class="p">(</span><span class="ss">:around</span><span class="p">))</span>
<span class="w">        </span><span class="p">(</span><span class="nv">ifs</span><span class="w"> </span><span class="p">(</span><span class="ss">:if</span><span class="p">))</span>
<span class="w">        </span><span class="p">(</span><span class="nv">befores</span><span class="w"> </span><span class="p">(</span><span class="ss">:before</span><span class="p">))</span>
<span class="w">        </span><span class="p">(</span><span class="nv">primaries</span><span class="w"> </span><span class="p">()</span><span class="w"> </span><span class="ss">:order</span><span class="w"> </span><span class="nv">order</span><span class="w"> </span><span class="ss">:required</span><span class="w"> </span><span class="no">t</span><span class="p">)</span>
<span class="w">        </span><span class="p">(</span><span class="nv">afters</span><span class="w"> </span><span class="p">(</span><span class="ss">:after</span><span class="p">)))</span>

<span class="w">       </span><span class="p">(</span><span class="k">let*</span><span class="w"> </span><span class="p">((</span><span class="nv">before-form</span><span class="w"> </span><span class="p">(</span><span class="nv">call-methods</span><span class="w"> </span><span class="nv">befores</span><span class="p">))</span>
<span class="w">              </span><span class="p">(</span><span class="nv">after-form</span><span class="w"> </span><span class="p">(</span><span class="nv">call-methods</span><span class="w"> </span><span class="nv">afters</span><span class="p">))</span>
<span class="w">              </span><span class="p">(</span><span class="nv">primary-form</span><span class="w"> </span><span class="o">`</span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="o">,</span><span class="p">(</span><span class="nb">car</span><span class="w"> </span><span class="nv">primaries</span><span class="p">)</span><span class="w"> </span><span class="o">,</span><span class="p">(</span><span class="nb">cdr</span><span class="w"> </span><span class="nv">primaries</span><span class="p">)))</span>
<span class="w">              </span><span class="p">(</span><span class="nv">core-form</span><span class="w"> </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nb">or</span><span class="w"> </span><span class="nv">befores</span><span class="w"> </span><span class="nv">afters</span><span class="w"> </span><span class="p">(</span><span class="nb">cdr</span><span class="w"> </span><span class="nv">primaries</span><span class="p">))</span>
<span class="w">                             </span><span class="o">`</span><span class="p">(</span><span class="nb">prog1</span>
<span class="w">                                  </span><span class="p">(</span><span class="k">progn</span>
<span class="w">                                    </span><span class="o">,@</span><span class="nv">before-form</span>
<span class="w">                                    </span><span class="o">,</span><span class="nv">primary-form</span><span class="p">)</span>
<span class="w">                                </span><span class="o">,@</span><span class="nv">after-form</span><span class="p">)</span>

<span class="w">                             </span><span class="o">`</span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="o">,</span><span class="p">(</span><span class="nb">car</span><span class="w"> </span><span class="nv">primaries</span><span class="p">))))</span>
<span class="w">              </span><span class="p">(</span><span class="nv">around-form</span><span class="w"> </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="nv">arounds</span>
<span class="w">                               </span><span class="o">`</span><span class="p">(</span><span class="nb">call-method</span><span class="w"> </span><span class="o">,</span><span class="p">(</span><span class="nb">car</span><span class="w"> </span><span class="nv">arounds</span><span class="p">)</span>
<span class="w">                                             </span><span class="p">(</span><span class="o">,@</span><span class="p">(</span><span class="nb">cdr</span><span class="w"> </span><span class="nv">arounds</span><span class="p">)</span>
<span class="w">                                              </span><span class="p">(</span><span class="nb">make-method</span><span class="w"> </span><span class="o">,</span><span class="nv">core-form</span><span class="p">)))</span>

<span class="w">                               </span><span class="nv">core-form</span><span class="p">)))</span>

<span class="w">         </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="nv">ifs</span>
<span class="w">             </span><span class="o">`</span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nb">and</span><span class="w"> </span><span class="o">,@</span><span class="p">(</span><span class="nv">call-methods</span><span class="w"> </span><span class="nv">ifs</span><span class="p">))</span>
<span class="w">                  </span><span class="o">,</span><span class="nv">around-form</span><span class="p">)</span>

<span class="w">             </span><span class="nv">around-form</span><span class="p">)))</span>
</pre></div>

<p>
The macro is described in detail in the <a href="https://novaspec.org/cl/f_define-method-combination">hyperspec</a>, but its
behaviour is quite simple. The list of forms&nbsp;(<code>arounds</code> and so on)
define variables that extract the methods that have the given
decorations –&nbsp;so <code>arounds</code> gets a list&nbsp;of <code>:around</code> methods,
<code>primaries</code> gets the undecorated (primary) methods, and so on. In&nbsp;particular, <code>ifs</code> gets any methods decorated&nbsp;with <code>:if</code>: these are
the&nbsp;guards.
</p>

<p>
The body of the macro constructs the code needed to build the
methods&#8217; behaviours.&nbsp;The <code>let*</code> defines the code for the different&nbsp;parts. <code>core-form</code> is slightly optimised in the case when there is
only one primary method; otherwise it runs&nbsp;the <code>:before</code> methods
and then the primary method, captures the result of the latter,
then runs&nbsp;the <code>:after</code> methods, and then returns its result. (This
is the first time I&#8217;ve ever&nbsp;used <code>prog1</code> for real: now I know why
it exists.) If there&nbsp;are <code>:around</code> methods, <code>around-form</code> wraps up a
list consisting of&nbsp;the <code>:around</code> methods and a method constructed&nbsp;from <code>core-form</code>, letting it be run as the result of the&nbsp;final
<code>call-next-method</code> call.
</p>

<p>
The body of&nbsp;the <code>let*</code> wraps-up <code>around-form</code> within&nbsp;an <code>if</code> whose
condition is the conjunction of all&nbsp;the <code>:if</code> methods. Only if all
these methods return true (well,&nbsp;not <code>nil</code> in the usual Lisp style)
will the code&nbsp;of <code>around-form</code> be executed. Again the code is
optimised for the case where there are no guards, in which case
we just&nbsp;get <code>around-form</code>.
</p>

<p>
Notice&nbsp;that <code>define-method-combination</code> returns <i>code</i>, like all
macros: it doesn&#8217;t execute the methods itself. This is a hint as
to what happens off-stage: <span class="caps">CLOS</span> uses the method combination at
compile time to construct effective methods which can then be
cached to minimise the performance hit from all the flexibility
provided by method&nbsp;combination.
</p>

<p>
Now we can re-do our example from&nbsp;above:
</p>

<div class="highlight"><pre><span></span><span class="w">     </span><span class="c1">;; a generic function defined to use our new method combination</span>
<span class="w">     </span><span class="p">(</span><span class="nb">defgeneric</span><span class="w"> </span><span class="nv">guarded-example</span><span class="w"> </span><span class="p">(</span><span class="nv">v</span><span class="p">)</span>
<span class="w">       </span><span class="p">(</span><span class="ss">:method-combination</span><span class="w"> </span><span class="nv">guarded</span><span class="p">))</span>

<span class="w">     </span><span class="c1">;; the functionality, split into two methods</span>
<span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">guarded-example</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">integer</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="nb">*</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">2</span><span class="p">))</span>

<span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">guarded-example</span><span class="w"> </span><span class="ss">:around</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">integer</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="k">if</span><span class="w"> </span><span class="p">(</span><span class="nb">=</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">5</span><span class="p">)</span>
<span class="w">           </span><span class="p">(</span><span class="nb">+</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">1</span><span class="p">)</span>
<span class="w">           </span><span class="p">(</span><span class="nb">call-next-method</span><span class="p">)))</span>

<span class="w">     </span><span class="c1">;; this guard used to be :around and is now :if</span>
<span class="w">     </span><span class="p">(</span><span class="nb">defmethod</span><span class="w"> </span><span class="nv">guarded-example</span><span class="w"> </span><span class="ss">:if</span><span class="w"> </span><span class="p">((</span><span class="nv">v</span><span class="w"> </span><span class="nc">number</span><span class="p">))</span>
<span class="w">       </span><span class="p">(</span><span class="nb">&gt;</span><span class="w"> </span><span class="nv">v</span><span class="w"> </span><span class="mi">10</span><span class="p">))</span>

<span class="w">     </span><span class="p">(</span><span class="nb">list</span><span class="w"> </span><span class="p">(</span><span class="nv">guarded-example</span><span class="w"> </span><span class="mi">26</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nv">guarded-example</span><span class="w"> </span><span class="mi">2</span><span class="p">)</span><span class="w"> </span><span class="p">(</span><span class="nv">guarded-example</span><span class="w"> </span><span class="mi">5</span><span class="p">))</span>
</pre></div>
<p>
(52 <span class="caps">NIL</span>&nbsp;<span class="caps">NIL</span>)
</p>

<p>
The guard now stops execution of the effective method if its
condition isn&#8217;t met – and if it <i>is</i> met, passes control through
to the complete method stack. This happens regardless of where
the guard is specialised in terms of the class hierarchy: the
guards run before any &#8220;functional&#8221; code.&nbsp;(That <code>:before</code> and <code>:after</code>
methods work too, and multiple guards, and that the combination
works when applied to class hierarchies, are left as exercises to
the&nbsp;reader.)
</p>
</div>
</div>
